-- 직급 테이블 데이터 추가
INSERT INTO `POSITION`(PO_NAME) VALUES('사원'),('주임'),('대리'),('과장'),('차장'),('부장');

-- 근무상태 테이블 데이터 추가
INSERT INTO `STATE`(ST_TYPE) VALUES('재직'),('휴직'),('퇴직');

-- 부서 테이블 데이터 추가
INSERT INTO `DEPARTMENT`(DM_NAME) VALUES('대기'),('기획부서'),('마케팅부서'),('시스템부서'),('금융부서');

-- 직원 테이블 데이터 추가 (EP_DM_NUM, EP_PO_NUM, EP_ST_NUM 디폴트 = 1, EP_LEAVE 디폴트 = 15)
INSERT INTO `EMPLOYEE`(EP_NAME, EP_EMAIL, EP_PHONE_NUM, EP_DM_NUM, EP_PO_NUM, EP_ST_NUM, EP_LEAVE, EP_SALAY)
values
	('김첨지', 'kcj@pmcompany.kr', '010-1111-1111', 2, 6, 1, 10, 500),
	('홍길동', 'hkd@pmcompany.kr', '010-2222-2222', 3, 6, 1, 8, 500),
    ('임창정', 'lcj@pmcompany.kr', '010-3333-3333', 4, 6, 1, 12, 500),
    ('이순신', 'lss@pmcompany.kr', '010-4444-4444', 5, 6, 1, 6, 500),
    ('김중배', 'kjb@pmcompany.kr', '010-1234-1111', 2, 5, 1, 2, 450),
    ('박나라', 'pnl@pmcompany.kr', '010-5678-2222', 3, 5, 1, 11, 450),
    ('정도전', 'jdj@pmcompany.kr', '010-9123-3333', 4, 5, 1, 7, 450),
    ('민기옥', 'mko@pmcompany.kr', '010-4567-4444', 5, 5, 1, 14, 450),
    ('전해리', 'jhl@pmcompany.kr', '010-4321-1111', 2, 4, 1, 7, 400),
    ('유해진', 'lhj@pmcompany.kr', '010-8765-2222', 3, 4, 1, 6, 400),
    ('고길동', 'ggd@pmcompany.kr', '010-3219-3333', 4, 4, 1, 12, 400),
    ('신선아', 'ssa@pmcompany.kr', '010-7654-4444', 5, 4, 1, 9, 400),
    ('구하라', 'ghr@pmcompany.kr', '010-1212-1111', 2, 3, 1, 3, 350),
    ('이병헌', 'lbh@pmcompany.kr', '010-2323-2222', 3, 3, 1, 9, 350),
    ('박서준', 'psj@pmcompany.kr', '010-3434-3333', 4, 3, 1, 8, 350),
    ('이형기', 'lhk@pmcompany.kr', '010-4545-4444', 5, 3, 1, 7, 350),
    ('추신수', 'css@pmcompany.kr', '010-5555-1111', 2, 2, 1, 3, 300),
    ('이만기', 'lmk@pmcompany.kr', '010-6666-2222', 3, 2, 1, 4, 300),
    ('마소희', 'msh@pmcompany.kr', '010-7777-3333', 4, 2, 1, 6, 300),
    ('김진수', 'kjs@pmcompany.kr', '010-8888-4444', 5, 2, 1, 10, 300),
    ('오만수', 'oms@pmcompany.kr', '010-5656-1111', 2, 1, 1, 8, 250),
    ('구본혁', 'kbh@pmcompany.kr', '010-6767-2222', 3, 1, 1, 7, 250),
    ('강기혁', 'kkh@pmcompany.kr', '010-7878-3333', 4, 1, 1, 7, 250),
    ('정주영', 'jjy@pmcompany.kr', '010-8989-4444', 5, 1, 1, 6, 250),
    ('최대기', 'cdk@pmcompany.kr', '010-9999-9999', 1, 1, 1, 6, 250),
    ('김휴직', 'khj@pmcompany.kr', '010-0000-0000', 4, 5, 2, 8, 0),
    ('이퇴직', 'ltj@pmcompany.kr', '010-0101-0101', 5, 4, 3, 0, 0),
    ('나애진', 'naj@pmcompany.kr', '010-0202-0202', 2, 1, 3, 0, 0)
    ;

-- 프로젝트 테이블 데이터 추가
INSERT INTO `PROJECT`(PJ_NAME, PJ_START_DATE, PJ_END_DATE, PJ_STATE) 
VALUES
	('종료 프로젝트1', '2022-09-06', '2023-03-21', '종료'),
    ('종료 프로젝트2', '2022-11-12', '2023-06-30', '종료'),
    ('진행 프로젝트1', '2023-04-07', '', '진행'),
    ('진행 프로젝트2', '2023-08-02', '', '진행'),
    ('예정 프로젝트1', '', '', '예정');
    
-- 프로젝트정보 테이블 데이터 추가
INSERT INTO `PROJECT_INFO`(Pi_EP_ID, PI_PJ_NUM, PI_ROLE) 
values
	(1,1,'팀장'),(26,1,'부팀장'),(10,1,'팀원'),(15,1,'팀원'),(18,1,'팀원'),(28,1,'팀원'),
    (2,2,'팀장'),(7,2,'부팀장'),(27,2,'팀원'),(14,2,'팀원'),(17,2,'팀원'),(21,2,'팀원'),
    (3,3,'팀장'),(6,3,'부팀장'),(12,3,'팀원'),(16,3,'팀원'),(19,3,'팀원'),(22,3,'팀원'),
    (4,4,'팀장'),(8,4,'부팀장'),(9,4,'팀원'),(13,4,'팀원'),(20,4,'팀원'),(2,4,'팀원'),
    (1,5,'팀장'),(5,5,'부팀장'),(11,5,'팀원'),(14,5,'팀원'),(17,5,'팀원'),(23,5,'팀원');

-- 부서이동내역 테이블 데이터 추가
INSERT INTO `TRANSFER`(TR_DATE, TR_REASON, TR_EP_ID, TR_DM_NUM) 
VALUES
	('2023-02-27', '공석 보충', 12, 5),
    ('2023-05-30', '공석 보충', 23, 2);

-- 휴가 테이블 데이터 추가
INSERT INTO `LEAVE`(LE_START_NUM, LE_END_DATE, LE_TYPE, LE_EP_ID) 
VALUES
	('2022-12-24', '2022-12-24', '연차', 12),
    ('2023-03-02', '2022-03-05', '경조사', 5),
    ('2023-08-16', '2023-08-16', '연차', 17);
    
-- 퇴직/휴직 정보 테이블 데이터 추가
INSERT INTO `TERMINATION`(TM_DATE, TM_REASON, TM_EP_ID) 
VALUES ('2023-04-06', '육아휴직', 26), ('2023-07-03', '퇴직', 27), ('2023-05-29', '퇴직', 28);

-- 급여사유 테이블 데이터 추가
INSERT INTO `PROJECT` VALUES('월급'),('성과금'),('퇴직금'); 

-- 급여이력 테이블 데이터 추가



